In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [47]:
df1 = pd.read_csv("C:\\Users\\Maria Camila Corvach\\Documents\\Python\\Data_cleaning\\Customer_segmentation.csv")
df2 = pd.read_csv("C:\\Users\\Maria Camila Corvach\\Documents\\Python\\Data_cleaning\\Train_Customer_Segmentation.csv")

df = pd.concat([df1, df2], axis = 0)
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6,B
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6,A
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6,A
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6,B
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6,A

In [48]:
df.shape

(10695, 11)

In [49]:
df.drop('Segmentation', axis=1, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10695 entries, 0 to 8067
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               10695 non-null  int64
 1   Gender           10695 non-null  object
 2   Ever_Married     10505 non-null  object
 3   Age              10695 non-null  int64
 4   Graduated        10593 non-null  object
 5   Profession       10533 non-null  object
 6   Work_Experience  9597 non-null   float64
 7   Spending_Score   10695 non-null  object
 8   Family_Size      10247 non-null  float64
 9   Var_1            10587 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 919.1+ KB

In [50]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,10695.0,463468.088640,2600.966411,458982.0,461220.5,463451.0,465733.5,467974.0
Age,10695.0,43.511828,16.774158,18.0,30.0,41.0,53.0,89.0
Work_Experience,9597.0,2.619777,3.390790,0.0,0.0,1.0,4.0,14.0
Family_Size,10247.0,2.844052,1.536427,1.0,2.0,3.0,4.0,9.0

In [51]:
df.Var_1.value_counts() # pediente countplot

Var_1
Cat_6    6910
Cat_4    1475
Cat_3    1089
Cat_2     563
Cat_7     269
Cat_1     167
Cat_5     114
Name: count, dtype: int64

In [52]:
df.Var_1.isnull().sum()

108

In [53]:
df.Profession.value_counts()

Profession
Artist           3318
Healthcare       1750
Entertainment    1250
Engineer          935
Doctor            930
Lawyer            844
Executive         775
Marketing         403
Homemaker         328
Name: count, dtype: int64

In [54]:
df.Profession.isnull().sum()

162

In [55]:
df.drop(df.index[df.Profession.isnull()], inplace=True)
df.drop(df.index[df.Var_1.isnull()], inplace= True)
df.shape

(10295, 10)

In [45]:
"""df.dropna(subset=['Var_1'], inplace=True)
df.dropna(subset=['Profession'], inplace=True)
df.shape"""

(10428, 10)